<?php

declare(strict_types=1);

namespace GarbuzIvan\TelegramBot;

class Dict
{
    public static function getShop(): array
    {
        return [
            1 => ['price' => 100, 'text'  => "Куртка", 'callback_data' => 'Вы купили куртку!'],
            2 => ['price' => 100, 'text'  => "Пальто", 'callback_data' => 'Вы купили пальто!'],
            3 => ['price' => 100, 'text'  => "Шуба", 'callback_data' => 'Вы купили шубу!'],
            4 => ['price' => 100, 'text'  => "\xF0\x9F\x8E\xA9 Шапка", 'callback_data' => 'Вы купили шапку!'],
            5 => ['price' => 100, 'text'  => "Кепка", 'callback_data' => 'Вы купили купку!'],
            6 => ['price' => 100, 'text'  => "\xF0\x9F\x91\xA0 Туфли", 'callback_data' => 'Вы купили туфли!'],
            7 => ['price' => 100, 'text'  => "\xF0\x9F\x91\x9F Кроссовки", 'callback_data' => 'Вы купили кроссовки!'],
            8 => ['price' => 100, 'text'  => "\xF0\x9F\x91\x9F Кеды", 'callback_data' => 'Вы купили кеды!'],
            9 => ['price' => 100, 'text'  => "Босоножки", 'callback_data' => 'Вы купили босоножки!'],
            10 => ['price' => 100, 'text'  => "\xF0\x9F\x91\xA2 Сапоги", 'callback_data' => 'Вы купили сапоги!'],
            11 => ['price' => 100, 'text'  => "Чулки", 'callback_data' => 'Вы купили чулки!'],
            12 => ['price' => 100, 'text'  => "Колготки", 'callback_data' => 'Вы купили колготки!'],
            13 => ['price' => 100, 'text'  => "\xF0\x9F\x91\x96 Штаны", 'callback_data' => 'Вы купили штаны!'],
            14 => ['price' => 100, 'text'  => "\xF0\x9F\x91\x96 Джинсы", 'callback_data' => 'Вы купили джинсы!'],
            15 => ['price' => 100, 'text'  => "\xF0\x9F\x91\x95 Майка", 'callback_data' => 'Вы купили майку!'],
            16 => ['price' => 100, 'text'  => "Кофта", 'callback_data' => 'Вы купили кофту!'],
            17 => ['price' => 100, 'text'  => "Свитер", 'callback_data' => 'Вы купили свитер!'],
            18 => ['price' => 100, 'text'  => "Пайта", 'callback_data' => 'Вы купили пайту!'],
            19 => ['price' => 100, 'text'  => "\xF0\x9F\x91\x99 Трусы", 'callback_data' => 'Вы купили трусы!'],
            20 => ['price' => 100, 'text'  => "\xF0\x9F\x91\x99 Лифчик", 'callback_data' => 'Вы купили лифчик!'],
            21 => ['price' => 2000, 'text'  => "Свадебный костюм", 'callback_data' => 'Вы купили свадебный костюм!'],
            22 => ['price' => 2000, 'text'  => "\xF0\x9F\x91\x97 Свадебное платье", 'callback_data' => 'Вы купили свадебное платье!'],
            23 => ['price' => 100, 'text'  => "\xF0\x9F\x92\x90 Букет", 'callback_data' => 'Вы купили букет!'],
            24 => ['price' => 100, 'text'  => "\xF0\x9F\x92\x8D Кольцо", 'callback_data' => 'Вы купили кольцо!'],
            25 => ['price' => 100, 'text'  => "\xE2\x8F\xB0 Часы", 'callback_data' => 'Вы купили часы!'],
            26 => ['price' => 100, 'text'  => "Сережки", 'callback_data' => 'Вы купили сережки!'],
            27 => ['price' => 100, 'text'  => "Браслет", 'callback_data' => 'Вы купили браслет!'],
            28 => ['price' => 100, 'text'  => "\xF0\x9F\x90\x95 Собаку", 'callback_data' => 'Вы купили собаку!'],
            29 => ['price' => 100, 'text'  => "\xF0\x9F\x90\x88 Котенка", 'callback_data' => 'Вы купили котенка!'],
            30 => ['price' => 100, 'text'  => "\xF0\x9F\x8E\xB8 Гитару", 'callback_data' => 'Вы купили гитару!'],
            31 => ['price' => 100, 'text'  => "\xF0\x9F\x8F\x80 Мяч", 'callback_data' => 'Вы купили мяч!'],
        ];
    }

    public static function getWherePeople(): array
    {
        return [
            'щеку',
            'шею',
            'шейку',
            'нос',
            'губы',
            'лоб',
            'плечо',
            'локоть',
            'кисть',
            'руку',
            'ногу',
            'палец',
            'писюн',
            'член',
            'влагалище',
            'попу',
            'жопу',
            'булку',
            'мизинец',
            'лодошку',
            'пятку',
            'провь',
            'зубы',
            'подбородок',
        ];
    }

    public static function getWhere(): array
    {
        return [
            'Дома',
            'За гаражами',
            'В столовой',
            'В ресторане',
            'В спальне',
            'На подоконнике',
            'На столе',
            'В Москве',
            'В Питере',
            'В Крыму',
            'В Турции',
            'В Италии',
            'В жопе',
            'В пизде',
            'На горе',
            'В море',
            'В открытом океане',
            'В космосе',
            'В пивнухе',
            'В шалаше',
            'В гостинице',
            'В отеле',
            'В приюте для животных',
            'В альпах',
            'На Эльфелевой башне',
            'На пирамиде в Египте',
            'На лошади',
            'В машине',
            'На багажнике автомобиля',
            'На капоте автомобиля',
            'На заднем сидении',
            'В туалете',
            'на балконе',
            'на кухне',
            'на лавочке',
            'на полу',
            'на кровати',
            'на диване',
            'в спальне',
            'в мавзолее',
            'в подъезде',
            'в парке',
            'в кафе',
            'в гостях',
            'в душе',
            'в лифте',
            'в бассейне',
            'в общественом транспорте',
            'на сеновале',
            'на пляже',
            'на съемках порно фильма',
            'на подоконнике',
            'на помойке',
            'вися на турнике',
        ];
    }

    /**
     * @param array $dict
     * @return mixed
     */
    public static function rand(array $dict)
    {
        return trim(mb_strtolower($dict[array_rand($dict)]));
    }
}
